Revit 2024 API
VertexBuffer.GetVertexStreamPositionNormal Method
 Gets a stream that can be used to write vertices of type VertexPositionNormal into the buffer.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public VertexStreamPositionNormal GetVertexStreamPositionNormal()
Visual Basic
Public Function GetVertexStreamPositionNormal As VertexStreamPositionNormal
Visual C++
public:
VertexStreamPositionNormal^ GetVertexStreamPositionNormal()
Return Value
 The stream that can be used to write into this buffer.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown if the buffer is not mapped. -or- Thrown if the buffer has insufficient space.
See Also
VertexBuffer Class
Autodesk.Revit.DB.DirectContext3D Namespace